# Gu√≠a Configuraci√≥n QoS en Cisco Router y Switch

## üß† Introducci√≥n

**QoS (Quality of Service)** es un conjunto de t√©cnicas utilizadas en redes para **priorizar ciertos tipos de tr√°fico** y **garantizar la calidad en la transmisi√≥n de datos sensibles al retardo**, como la voz y el video.
En redes donde se utiliza **FreePBX** u otro sistema de telefon√≠a IP, QoS es esencial para evitar **retardos, jitter y p√©rdida de paquetes** durante las llamadas.

Cisco implementa QoS a trav√©s de cuatro procesos principales:

* **Clasificaci√≥n:** Identificaci√≥n del tr√°fico por protocolo o puerto.
* **Marcado:** Etiquetado del tr√°fico con un valor de prioridad.
* **Priorizaci√≥n:** Asignaci√≥n de recursos o colas espec√≠ficas.
* **Control:** Aplicaci√≥n de pol√≠ticas que aseguran el uso eficiente del ancho de banda.

En este procedimiento se configura **QoS** y **una VLAN exclusiva de voz**, garantizando que los paquetes SIP/RTP del servidor **FreePBX** sean tratados con la m√°xima prioridad.

---

## ‚öôÔ∏è Configuraci√≥n en el Router Cisco

### 1. Crear una ACL extendida para identificar el tr√°fico de voz
```bash
Router(config)# access-list 100 permit udp any any eq 5060
Router(config)# access-list 100 permit udp any any range 5061 5062
Router(config)# access-list 100 permit udp any any range 10000 20000
```

#### üîç Explicaci√≥n t√©cnica

* `access-list 100`: Crea una ACL extendida numerada para clasificar tr√°fico.
* `permit udp any any eq 5060`: Identifica el tr√°fico de se√±alizaci√≥n **SIP** (puerto UDP 5060).
* `permit udp any any range 5061 5062`: Identifica tr√°fico SIP adicional (puertos UDP 5061-5062).
* `permit udp any any range 10000 20000`: Identifica el tr√°fico de voz **RTP** (puertos UDP 10000-20000).
* **Nota:** Ajusta el rango RTP seg√∫n la configuraci√≥n de tu FreePBX (Settings ‚Üí Asterisk SIP Settings ‚Üí RTP Port Range).

---

### 2. Crear una *Class-Map* para identificar el tr√°fico de voz
```bash
Router(config)# class-map match-any VOZ
Router(config-cmap)# match access-group 100
Router(config-cmap)# exit
```

#### üîç Explicaci√≥n t√©cnica

* `class-map match-any VOZ`: Crea una clase de tr√°fico llamada **VOZ**.
* `match access-group 100`: Clasifica el tr√°fico que coincida con la ACL 100 (SIP/RTP).
* `match-any`: Clasifica el tr√°fico que cumpla **cualquiera** de los criterios de la ACL.

---

### 3. Crear una *Policy-Map* para priorizar el tr√°fico de voz
```bash
Router(config)# policy-map QOS-VOZ
Router(config-pmap)# class VOZ
Router(config-pmap-c)# priority percent 70
Router(config-pmap-c)# exit
Router(config-pmap)# class class-default
Router(config-pmap-c)# fair-queue
Router(config-pmap-c)# exit
Router(config-pmap)# exit
```

#### üîç Explicaci√≥n t√©cnica

* `policy-map QOS-VOZ`: Define una pol√≠tica global para manejar el tr√°fico.
* `class VOZ`: Llama a la clase creada anteriormente.
* `priority percent 70`: Reserva el **70% del ancho de banda** para la voz (cola de baja latencia - LLQ).
* `class class-default`: Aplica una pol√≠tica al resto del tr√°fico no clasificado.
* `fair-queue`: Asigna el ancho de banda restante de forma equitativa entre los flujos restantes.

---

### 4. Aplicar la pol√≠tica en la interfaz de salida

#### Escenario 1: Llamadas hacia Internet (Trunk SIP externo)
```bash
Router(config)# interface GigabitEthernet0/0/0
Router(config-if)# service-policy output QOS-VOZ
```

#### Escenario 2: Llamadas internas entre VLANs
```bash
Router(config)# interface GigabitEthernet0/0/1
Router(config-if)# service-policy output QOS-VOZ
```

#### Escenario 3: Ambos casos (Recomendado)
```bash
Router(config)# interface GigabitEthernet0/0/0
Router(config-if)# service-policy output QOS-VOZ
Router(config-if)# exit

Router(config)# interface GigabitEthernet0/0/1
Router(config-if)# service-policy output QOS-VOZ
```

#### üîç Explicaci√≥n t√©cnica

* `service-policy output QOS-VOZ`: Aplica la pol√≠tica **en la direcci√≥n de salida** de la interfaz.
* **Interfaz WAN (G0/0/0):** Prioriza el tr√°fico de voz hacia Internet (trunk SIP externo).
* **Interfaz LAN (G0/0/1):** Prioriza el tr√°fico de voz entre VLANs internas.
* **Importante:** Ajusta los nombres de las interfaces seg√∫n tu modelo de router (algunos usan `G0/0` en lugar de `G0/0/0`).

---

### 5. Verificar la configuraci√≥n
```bash
Router# show access-list 100
Router# show policy-map interface GigabitEthernet0/0/1
Router# show class-map
```

#### üîç Explicaci√≥n t√©cnica

* `show access-list 100`: Muestra los criterios de la ACL y el n√∫mero de coincidencias.
* `show policy-map interface`: Muestra las estad√≠sticas de paquetes clasificados por cada clase.
* Permite confirmar si los paquetes SIP y RTP est√°n siendo detectados y priorizados.
* **Durante una llamada activa**, deber√≠as ver el contador de packets aumentar en la clase VOZ.

---

## ‚öôÔ∏è Configuraci√≥n en el Switch Cisco

### 1. Crear la VLAN de voz
```bash
Switch(config)# vlan 20
Switch(config-vlan)# name VOZ
Switch(config-vlan)# exit
```

#### üîç Explicaci√≥n t√©cnica

* `vlan 20`: Crea una VLAN identificada con el n√∫mero 20, reservada para voz.
* `name VOZ`: Asigna un nombre descriptivo.
* Esta VLAN separa el tr√°fico de voz del resto, mejorando el rendimiento y el control de QoS.

---

### 2. Activar QoS globalmente
```bash
Switch(config)# mls qos
```

#### üîç Explicaci√≥n t√©cnica

* `mls qos`: Activa el motor de QoS en el plano de conmutaci√≥n del switch.
  A partir de este punto, el switch puede clasificar y priorizar el tr√°fico seg√∫n los valores CoS/DSCP.

---

### 3. Configurar el puerto donde se conecta FreePBX o los tel√©fonos IP
```bash
Switch(config)# interface FastEthernet0/10
Switch(config-if)# switchport mode access
Switch(config-if)# switchport access vlan 10
Switch(config-if)# switchport voice vlan 20
Switch(config-if)# mls qos trust cos
Switch(config-if)# spanning-tree portfast
Switch(config-if)# exit
```

#### üîç Explicaci√≥n t√©cnica

* `switchport mode access`: Configura el puerto en modo acceso (NO trunk).
* `switchport access vlan 10`: Asigna la VLAN de datos para el PC u otros dispositivos (tr√°fico sin etiquetar).
* `switchport voice vlan 20`: Asigna la VLAN de voz para el tr√°fico de telefon√≠a IP (tr√°fico etiquetado 802.1Q).
* `mls qos trust cos`: Indica al switch que conf√≠e en el **valor CoS (Class of Service)** marcado por el tel√©fono IP o el servidor FreePBX.
* `spanning-tree portfast`: Optimiza la convergencia del puerto, evitando retardos al iniciar el enlace (solo usar en puertos finales, nunca en trunks).
* **Nota:** El puerto permite tr√°fico de DOS VLANs simult√°neamente: datos (untagged) y voz (tagged), sin necesidad de configurarlo como trunk.

---

### 4. Mapear valores CoS a DSCP
```bash
Switch(config)# mls qos map cos-dscp 0 8 16 24 32 46 48 56
```

#### üîç Explicaci√≥n t√©cnica

* Este comando relaciona los valores **CoS (Capa 2)** con **DSCP (Capa 3)**.
* **Mapeo est√°ndar:**
  * CoS 0 ‚Üí DSCP 0 (Best Effort)
  * CoS 1 ‚Üí DSCP 8
  * CoS 2 ‚Üí DSCP 16
  * CoS 3 ‚Üí DSCP 24
  * CoS 4 ‚Üí DSCP 32
  * CoS 5 ‚Üí DSCP 46 **(EF - Expedited Forwarding)** ‚Üê Tr√°fico de voz
  * CoS 6 ‚Üí DSCP 48
  * CoS 7 ‚Üí DSCP 56
* El valor **46 (EF)** es el est√°ndar RFC 3246 para tr√°fico de voz y garantiza prioridad absoluta en toda la red.

---

### 5. Verificaci√≥n de QoS en el switch
```bash
Switch# show mls qos
Switch# show mls qos interface FastEthernet0/10
Switch# show mls qos maps cos-dscp
```

#### üîç Explicaci√≥n t√©cnica

* `show mls qos`: Muestra el estado global de QoS en el switch.
* `show mls qos interface`: Muestra el estado del puerto y las estad√≠sticas de QoS.
* `show mls qos maps cos-dscp`: Verifica las tablas de mapeo entre CoS y DSCP activas.

---

## üß™ Pruebas y Validaci√≥n

### En el Router:

1. **Realiza una llamada de prueba** desde FreePBX o un tel√©fono IP.
2. **Verifica que los contadores aumenten:**
```bash
   Router# show policy-map interface GigabitEthernet0/0/1
```
3. **Deber√≠as ver:**
   * Packets increment√°ndose en la clase VOZ (SIP/RTP)
   * 0 drops en la clase VOZ (sin p√©rdida de paquetes)
   * Tr√°fico normal en class-default

### En el Switch:

1. **Verifica las estad√≠sticas del puerto:**
```bash
   Switch# show mls qos interface FastEthernet0/10 statistics
```
2. **Deber√≠as ver:**
   * Tr√°fico clasificado con CoS 5 (voz)
   * Tr√°fico de la VLAN 20 (voz) separado de la VLAN 10 (datos)

---

## üßæ Conclusi√≥n

Con esta configuraci√≥n se logra lo siguiente:

* **ACLs extendidas** para clasificar tr√°fico SIP/RTP de forma confiable en cualquier router Cisco.
* **VLAN dedicada a voz (VLAN 20)** para aislar el tr√°fico VoIP.
* **QoS activo en router y switch**, garantizando prioridad a los paquetes SIP/RTP.
* **Marcado y confianza en CoS/DSCP**, manteniendo coherencia de prioridad en toda la red.
* **Compatibilidad universal** sin depender de NBAR o protocolos espec√≠ficos del IOS.

El resultado es una red optimizada para **telefon√≠a IP con calidad estable**, evitando cortes y retardos durante las llamadas VoIP.

---

## üìù Notas Adicionales

### Ajuste de puertos RTP en FreePBX:

Si necesitas cambiar el rango de puertos RTP en FreePBX:
1. Accede a **Settings ‚Üí Asterisk SIP Settings**
2. Busca **RTP Port Range**
3. Configura el rango (por defecto: 10000-20000)
4. Aplica cambios y reinicia Asterisk
5. **Actualiza la ACL 100 en el router** con el nuevo rango

### Soluci√≥n de problemas:

* **Los paquetes no aumentan en la clase VOZ:**
  * Verifica que el tr√°fico est√© pasando por la interfaz donde aplicaste el QoS
  * Revisa los puertos RTP en FreePBX y ajusta la ACL
  * Usa `show access-list 100` para ver si hay coincidencias

* **Drops en la clase VOZ:**
  * Aumenta el porcentaje de prioridad (por ejemplo, 80%)
  * Verifica el ancho de banda disponible en la interfaz

* **El switch no marca el tr√°fico:**
  * Verifica que `mls qos` est√© activo globalmente
  * Confirma que el puerto tenga `mls qos trust cos`
  * Revisa que FreePBX o los tel√©fonos IP est√©n marcando el tr√°fico con CoS 5
